
export const SysCons = {
  PlatApp: '9050', // 平台应用
  PlatAppSmarterFin: '9050.150', // 智能财务管理系统
  PlatAppSmarterFinTradeEdition: '9050.150.10', // 智能财务普及版
  PlatAppSmarterFinStandard: '9050.150.20', // 智能财务标准版
  PlatAppSmarterFinProfessional: '9050.150.25', // "智能财务专业版"
  PlatAppSmarterFinPlatinumEdition: '9050.150.30', // 智能财务代账版

  PlatAppSmarterFinBackEnd: '9050.155', // 智能财务管理系统后台
  PlatAppMultiCorpRpt: '9050.160', // 神州开元跨账套报表
  PlatAppWorkbench: '9050.170', // 用户工作台

  persStatus: '1000', // 人员状态
  persStatusOk: '1000.100', // 正常
  persStatusUnOk: '1000.110', // 非正常

  education: '1100', // 学历
  educationYjs: '1100.100', // 研究生
  educationBk: '1100.110', // 大学本科
  educationBkx: '1100.120', // 大学本科以下

  employType: '1200', // 学历
  employTypeGy: '1200.100', // 雇员
  employTypeBxyxy: '1200.110', // 保险营销员
  employTypeZqjjr: '1200.120', // 证券经纪人
  employTypeSxxs: '1200.130', // 实习学生 全日制学历教育
  employTypeQt: '1200.140', // 其他

  entryType: '1300', // 入职年度就业情形
  entryTypeStudent: '1300.100', // 当年首次入职学生
  entryTypeOther: '1300.110', // 当年首次入职其他人员

  stateSucc: '020001', // 报送成功
  stateFail: '020002', // 报送失败
  stateDelWait: '020003', // 已删除待报送
  stateWAIT: '020004', // 待报送

  regionChina: '156', // 中国
  idType201: '201', // 居民身份证

  collectSrc1: '1', // 纳税人
  collectSrc2: '2', // 扣缴义务人

  relationZi: '2', // 子
  relationNv: '3', // 女
  relationFm: '5', // 父母
  relationQt: '8', // 其他
  eduStage10: '10', // 学前教育
  eduStage20: '20', // 义务教育
  eduStage30: '30', // 高中阶段
  eduStage40: '40', // 高等教育

  eduStageConEdu11: '11', // 博士研究生
  eduStageConEdu14: '14', // 硕士研究生
  eduStageConEdu20: '20', // 大学本科
  eduStageConEdu30: '30', // 大学专科
  eduStageConEdu91: '91', // 其他

  houseCertificateType1: '01', // 房屋所有权证
  houseCertificateType2: '02', // 不动产权证
  houseCertificateType3: '03', // 房屋买卖合同
  houseCertificateType4: '04', // 房屋预售合同

  leaserType0: '0', // 个人
  leaserType1: '1', // 组织
  // 附表填写状态
  AttachFormStatusFillDone: '1', // 已填写
  AttachFormStatusNotComplete: '2', // 待完善
  AttachFormStatusNotFill: '3', // 未填写
  AttachFormStatusNoNeed: '0', // 无需填写

  personCd10: '1.0', // 待验证
  personCd11: '1.1', // 验证通过
  personCd12: '1.2', // 验证不通过
  personCd13: '1.3', // 验证中
  personCd14: '1.4', // 暂不验证

  personCd20: '2.0', // 待报送
  personCd21: '2.1', // 报送成功
  personCd22: '2.2', // 报送失败
  personCd23: '2.3', // 待反馈
  personCd24: '2.4', // 已冻结

  personCd310: '3.10', // 雇员
  personCd321: '3.21', // 保险营销员
  personCd322: '3.22', // 证券经纪人
  personCd323: '3.23', // 实习学生（全日制学历教育）
  personCd329: '3.29', // 其他

  personCd401: '4.01', // 当年首次入职其他人员
  personCd499: '4.99', // 当年首次入职学生

  personCd510: '5.10', // 研究生
  personCd520: '5.20', // 大学本科
  personCd530: '5.30', // 大学本科以下

  InfoCollect: '100.0', // 人员信息采集

  AnnuityRecvByMonth: '134.111', // 按月
  AnnuityRecvBySeason: '134.112', // 按季
  AnnuityRecvByYear: '134.113', // 按年

  AnnuityRecvReasonWithPersonal: '134.121', // 出国定居或个人死亡
  AnnuityRecvReasonWithOther: '134.122', // 其他

  TaxItemInsure: '0402', // 保险营销员
  TaxItemSecurities: '0403', // 证券经纪人
  TaxItemOtherContinue: '0489', // 其他连续劳务

  TaxReportItemSalary: '131.0', // 正常工资薪金所得
  TaxReportItemBonus: '132.0', // 全年一次性奖金收入
  TaxReportItemAnnuity: '134.0', // 年金领取
  TaxReportItemAnnuityCalc: '134.1', // 年金领取_税款计算
  TaxReportItemBonusCalc: '132.1', // 全年一次性奖金收入_税款计算
  TaxReportItemSalaryCalc: '131.1', // 正常工资薪金所得_税款计算
  TaxReportItemContinueService: '138.0', // 劳务报酬(保险营销员、证券经纪人、其他连续劳务)
  TaxReportItemContinueServiceCalc: '138.1', // 劳务报酬(保险营销员、证券经纪人、其他连续劳务)_税款计算
  TaxReportItemNotContinueService: '139.0', // 劳务报酬(一般劳务、其他非连续劳务)
  ClassifiedItemPropertyLeasing: '142.0', // 分类所得申报——财产租赁所得

  // 财产租赁所得项目
  PropertyItemOhterLeasing: '0899', // 其他财产租赁所得
  PropertyItemPersonHouse: '0801', // 个人房屋出租所得

  // 申报类别
  DeclareTypeMulti: '13.0', // 综合所得申报
  DeclareTypeClassified: '14.0', // 分类所得申报

  // 减免事项类别
  ExemptItemClassFree: '13.311', // 免税收入附表
  ExemptItemClassDecrease: '13.312', // 减免税额附表
  ExemptItemClassDonation: '13.341', // 捐赠扣除附表

  // 所得项目
  ItemRegualrSalary: '0101', // 正常工资薪金
  ItemBonusIn: '0103', // 全年一次性奖金收入
  ItemAnnuityPick: '0110', // 年金领取
  ItemOtherProfit: '0799', // 其他利息、股息、红利所得
  ItemHouseLeasing: '0801', // 个人房屋出租所得
  ItemOtherPropertyLeasing: '0899' // 其他财产租赁所得
}

export const SysConsComm = {

  '1.0': '待验证',
  1.1: '验证通过',
  1.2: '验证不通过',
  1.3: '验证中',
  1.4: '暂不验证',

  '2.0': '待报送',
  2.1: '报送成功',
  2.2: '报送失败',
  2.3: '待反馈',
  2.4: '已冻结',

  '3.10': '雇员',
  3.21: '保险营销员',
  3.22: '证券经纪人',
  3.23: '实习学生（全日制学历教育）',
  3.29: '其他',

  4.01: '当年首次入职其他人员',
  4.99: '当年首次入职学生',

  '5.10': '研究生',
  '5.20': '大学本科',
  '5.30': '大学本科以下',

  '1601.0': '个人',
  1601.1: '组织',

  1600.01: '房屋所有权证',
  1600.02: '不动产权证',
  1600.03: '房屋买卖合同',
  1600.04: '房屋预售合同',

  1501.11: '博士研究生',
  1501.14: '硕士研究生',
  '1501.20': '大学本科',
  '1501.30': '大学专科',
  1501.91: '其他',

  1500.2: '子',
  1500.3: '女',
  1500.5: '父母',
  1500.8: '其他',
  '1500.10': '学前教育',
  '1500.20': '义务教育',
  '1500.30': '高中阶段',
  '1500.40': '高等教育',

  1400.1: '纳税人',
  1400.2: '扣缴义务人',

  156: '中国',
  201: '居民身份证',

  '020001': '报送成功',
  '020002': '报送失败',
  '020003': '已删除待报送',
  '020004': '待报送',

  1300: '入职年度就业情形',
  '1300.100': '当年首次入职学生',
  '1300.110': '当年首次入职其他人员',

  1200: '任职受雇从业类型',
  '1200.100': '雇员',
  '1200.110': '保险营销员',
  '1200.120': '证券经纪人',
  '1200.130': '实习学生',
  '1200.140': '其他',

  1100: '学历',
  '1100.100': '研究生',
  '1100.110': '大学本科',
  '1100.120': '大学本科以下',

  1000: '人员状态',
  '1000.100': '正常',
  '1000.110': '非正常',

  134.111: '按月',
  134.112: '按季',
  134.113: '按年',

  134.121: '出国定居或个人死亡',
  134.122: '其他',

  '131.0': '正常工资薪金所得',
  '132.0': '全年一次性奖金收入',
  '134.0': '年金领取',
  134.1: '税款计算_年金领取',
  132.1: '税款计算_全年一次性奖金收入',
  131.1: '税款计算_正常工资薪金所得',
  '138.0': '劳务报酬(保险营销员、证券经纪人、其他连续劳务)',
  138.1: '税款计算_劳务报酬',
  '0402': '保险营销员佣金收入',
  '0403': '证券经纪人佣金收入',
  '0489': '其他连续劳务报酬',
  '139.0': '劳务报酬(一般劳务、其他非连续劳务)',

  '142.0': '财产租赁所得',

  '0101': '正常工资薪金',
  '0103': '全年一次性奖金收入',
  '0110': '年金领取',
  '0799': '其他利息、股息、红利所得',
  '0899': '其他财产租赁所得',
  '0801': '个人房屋出租所得',

  1: '已填写',
  2: '待完善',
  3: '未填写',
  0: '无需填写',

  SXA031999999: '其他',
  SXA031900663: '符合条件的外交人员免征个人所得税',
  SXA031990003: '其他自然灾害受灾减免个人所得税',
  SXA031990001: '其他地区地震受灾减免个人所得税',
  SXA031900643: '高级专家延长离退休期间工薪免征个人所得税',
  SXA031900662: '解除劳动合同当地工资3倍以内免税',
  SXA031900634: '符合条件的津补贴免征个人所得税',
  SXA031900670: '生育津贴和生育医疗费免税',
  SXA031900642: '工伤保险免税',
  SXA031900660: '外籍个人出差补贴免税',
  SXA031900661: '外籍个人探亲费、语言训练费、子女教育费免税',
  SXA031900659: '外籍个人生活费用免税',
  SXA031900656: '符合条件的外籍来华专家工资薪金所得免征个人所得税',
  SXA031900657: '平潭台湾居民免税',
  SXA031900632: '安家费、退职费、退休工资、离休工资、离休生活补助费免税',
  SXA031005565: '远洋船员工资薪金收入减按50%征收个人所得税',
  SXA031005566: '职务科技成果转化减按50%计入科技人员当月“工资、薪金所得',
  SXA031900042: '残疾、孤老人员和烈属所得减征个人所得税',
  SXA031900640: '个人出租房屋减征个人所得税',

  '0005129999': '其他',
  '0005011605': '《中华人民共和国个人所得税法》 中华人民共和国主席令第48号第五条第二项',
  '0005011601': '《财政部 国家税务总局关于认真落实抗震救灾及灾后重建税收政策问题的通知》 财税〔2008〕62号第二条',
  '0005129917': '《财政部 国家税务总局关于福建平潭综合实验区个人所得税优惠政策的通知》 财税〔2014〕24号第二条',
  '0005012710': '《中华人民共和国个人所得税法》 中华人民共和国主席令第48号第五条第一项'
}

export const JobCons = {
  j21: '21', // 技能人员职业资格
  j22: '22', // 专业技术人员职业资格

  j10100: '10100', // 教师资格
  j10200: '10200', // 注册消防工程师
  j10300: '10300', // 法律职业资格
  j10400: '10400', // 中国委托公证人资格（香港、澳门）
  j10500: '10500', // 注册会计师
  j10600: '10600', // 民用核安全设备无损检验人员资格
  j10700: '10700', // 民用核设施操纵人员资格
  j10800: '10800', // 注册核安全工程师
  j10900: '10900', // 注册建筑师
  j11000: '11000', // 监理工程师
  j11100: '11100', // 房地产估价师
  j11200: '11200', // 造价工程师
  j11300: '11300', // 注册城乡规划师
  j11400: '11400', // 建造师
  j11500: '11500', // 勘察设计注册工程师
  j11501: '11501', // 注册结构工程师
  j11502: '11502', // 注册土木工程师
  j11503: '11503', // 注册化工工程师
  j11504: '11504', // 注册电气工程师
  j11505: '11505', // 注册公用设备工程师
  j11506: '11506', // 注册环保工程师
  j11507: '11507', // 注册石油天然气工程师
  j11508: '11508', // 注册冶金工程师
  j11509: '11509', // 注册采矿/矿物工程师
  j11510: '11510', // 注册机械工程师
  j11600: '11600', // 注册验船师
  j11700: '11700', // 船员资格（含船员、渔业船员）
  j11800: '11800', // 兽医资格
  j11801: '11801', // 执业兽医
  j11802: '11802', // 乡村兽医
  j11900: '11900', // 拍卖师
  j12000: '12000', // 演出经纪人员资格
  j12100: '12100', // 医生资格
  j12101: '12101', // 医师
  j12102: '12102', // 乡村医生
  j12103: '12103', // 人体器官移植医师
  j12200: '12200', // 护士执业资格
  j12300: '12300', // 母婴保健技术服务人员资格
  j12400: '12400', // 出入境检疫处理人员资格
  j12500: '12500', // 注册设备监理师
  j12600: '12600', // 注册计量师
  j12700: '12700', // 广播电视播音 员、主持人资格
  j12800: '12800', // 新闻记者职业资格
  j12900: '12900', // 注册安全工程师
  j13000: '13000', // 执业药师
  j13100: '13100', // 专利代理人
  j13200: '13200', // 导游资格
  j13300: '13300', // 注册测绘师
  j13400: '13400', // 航空人员资格
  j13401: '13401', // 空勤人员、地面人 员
  j13402: '13402', // 民用航空器外国驾驶员、领航员、飞行机械员、飞行通信员
  j13403: '13403', // 航空安全员
  j13404: '13404', // 民用航空电信人员、航行情报人员、气象人员
  j13600: '13600', // 特种设备检验、检测人员资格认定
  j13700: '13700', // 工程 咨询（投资）专业技术人员职业资格
  j13800: '13800', // 通信专业技术人员职业资格
  j13900: '13900', // 计算机技术与软件专业技术资格
  j14000: '14000', // 社会工作者职业资格
  j14100: '14100', // 会计专业技术资格
  j14200: '14200', // 资产评估师
  j14300: '14300', // 经济专业技术资格
  j14400: '14400', // 土地登记代理专业人员职业资格
  j14500: '14500', // 环境影响评价工程师
  j14600: '14600', // 房地产经纪专业人员职业资格
  j14700: '14700', // 机动车检测维修专业技术人员职业资格
  j14800: '14800', // 公路水运工程试验 检测专业技术人员职业资格
  j14900: '14900', // 水利工程质量检测员资格
  j15000: '15000', // 卫生专业技术资格
  j15100: '15100', // 审计专业技术资格
  j15200: '15200', // 税务师
  j15300: '15300', // 认证人员职业资格
  j15400: '15400', // 出版专业技术人员职业资格
  j15500: '15500', // 统计专业技术资格
  j15600: '15600', // 银行业专业人员职业资格
  j15700: '15700', // 证券期货业从业人员资格
  j15800: '15800', // 文物保护工程从业资格
  j15900: '15900', // 翻译专业资格
  j19901: '19901', // 招标师（2019）

  j20100: '20100', // 消防设施操作员
  j20200: '20200', // 焊工
  j20300: '20300', // 家畜繁殖员
  j20400: '20400', // 健身和娱乐场所服务人员
  j20401: '20401', // 游泳救生员
  j20402: '20402', // 社会体育指导员（游泳、滑雪、潜水、攀岩）
  j20500: '20500', // 轨道交通运输服务人员
  j20501: '20501', // 轨道列车司机
  j20600: '20600', // 机械设备修理人员
  j20601: '20601', // 设备点检员
  j20602: '20602', // 电工
  j20603: '20603', // 锅炉设备检修工
  j20604: '20604', // 变电设备检修工
  j20605: '20605', // 工程机械维修工
  j20700: '20700', // 通用工程机械操作人员
  j20701: '20701', // 起重装卸机械操作工
  j20800: '20800', // 建筑安装施工人员
  j20801: '20801', // 电梯安装维修工
  j20802: '20802', // 制冷空调系统安装维修工
  j20900: '20900', // 土木工程建筑施工人员
  j20901: '20901', // 筑路工
  j20902: '20902', // 桥隧工
  j20903: '20903', // 防水工
  j20904: '20904', // 电力电缆安装运维工
  j21000: '21000', // 房屋建筑施工人员
  j21001: '21001', // 砌筑工、混凝土工、钢筋工、架子工
  j21100: '21100', // 水生产、输排和水处理人员
  j21101: '21101', // 水生产处理工
  j21102: '21102', // 工业废水处理工
  j21200: '21200', // 气体生产、处理和输送人员
  j21201: '21201', // 工业气体生产工
  j21202: '21202', // 工业废气治理工
  j21203: '21203', // 压缩机操作工
  j21300: '21300', // 电力、热力生产 和供应人员
  j21301: '21301', // 锅炉运行值班员、发电集控值班员、变配电运行值班员、继电保护员
  j21302: '21302', // 燃气轮机值班员
  j21303: '21303', // 锅炉操作工
  j21400: '21400', // 仪器仪表装配人员
  j21401: '21401', // 钟表及计时仪器制造工
  j21500: '21500', // 电子设备装 配调试人员
  j21501: '21501', // 广电和通信设备电子装接工、广电和通信设备调试工
  j21600: '21600', // 计算机制造人员
  j21601: '21601', // 计算机及外部设备装配调试员
  j21700: '21700', // 电子器件制造人员
  j21701: '21701', // 液晶显示器件制造工
  j21702: '21702', // 半导体芯片 制造工、半导体分立器件和集成电路装调工
  j21800: '21800', // 电子元件制造人员
  j21801: '21801', // 电子产品制版工、印制电路制作工
  j21900: '21900', // 电线电缆、光纤光缆及电工器材制造人员
  j21901: '21901', // 电线电缆制造工
  j22000: '22000', // 输配电及控制设 备制造人员
  j22001: '22001', // 变压器互感器制造工
  j22002: '22002', // 高低压电器及成套设备装配工
  j22100: '22100', // 汽车整车制造人员
  j22101: '22101', // 汽车装调工
  j22200: '22200', // 医疗器械制品和康复辅具生产人员
  j22201: '22201', // 矫形器装配工、假肢装配工
  j22300: '22300', // 金属加工机械制造人员
  j22301: '22301', // 机床装调维修工
  j22400: '22400', // 工装工具制造加工人员
  j22401: '22401', // 模具工
  j22500: '22500', // 机械热加工人员
  j22501: '22501', // 铸造工、锻造工、金属热处理工
  j22600: '22600', // 机械冷加工人员
  j22601: '22601', // 车工、铣工
  j22602: '22602', // 钳工、磨工、冲压工
  j22603: '22603', // 电切削工
  j22700: '22700', // 硬质合金生产人员
  j22701: '22701', // 硬质合金成型工、硬质合金烧结工、硬质合金精加工工
  j22800: '22800', // 金属轧制人员
  j22801: '22801', // 轧制原料工、金属轧制工、金属材热处理工、金属 材精整工
  j22802: '22802', // 金属挤压工、铸轧工
  j22900: '22900', // 轻有色金属冶炼人员
  j22901: '22901', // 氧化铝制取工、铝电解工
  j23000: '23000', // 重有色金属冶炼人员
  j23001: '23001', // 重冶火法冶炼工、电解精炼工
  j23002: '23002', // 重冶湿法冶炼工
  j23100: '23100', // 炼钢人员
  j23101: '23101', // 炼钢原料工、炼钢工
  j23200: '23200', // 炼铁人员
  j23201: '23201', // 高炉原料工、高炉炼铁工、高炉运转工
  j23300: '23300', // 矿物采选人员
  j23301: '23301', // 井下支护工
  j23302: '23302', // 矿山救护工
  j23400: '23400', // 陶瓷制品制造人员
  j23401: '23401', // 陶瓷原料准备工、陶瓷烧成工、陶瓷装饰工
  j23500: '23500', // 玻璃纤维及玻璃纤维增强塑料制品制造人员
  j23501: '23501', // 玻璃纤维及制品工
  j23502: '23502', // 玻璃钢制品工
  j23600: '23600', // 水泥、石灰、石膏及其制品制造人员
  j23601: '23601', // 水泥 生产工、石膏制品生产工
  j23602: '23602', // 水泥混凝土制品工
  j23700: '23700', // 药物制剂人员
  j23701: '23701', // 药物制剂工
  j23800: '23800', // 中药饮片加工人员
  j23801: '23801', // 中药炮制工
  j23900: '23900', // 涂料、油墨、颜料及类似产品制造人员
  j23901: '23901', // 涂料生产工、 染料生产工
  j24000: '24000', // 农药生产人员
  j24001: '24001', // 农药生产工
  j24100: '24100', // 化学肥料生产人员
  j24101: '24101', // 合成氨生产工、尿素生产工
  j24200: '24200', // 基础化学原料制造人员
  j24201: '24201', // 硫酸生产工、硝酸生产工、纯碱生产工
  j24202: '24202', // 烧碱生产工、无机化学反应生产工
  j24203: '24203', // 有机合成工
  j24300: '24300', // 化工产品生产通用工艺人员
  j24301: '24301', // 化工总控工
  j24302: '24302', // 防腐蚀工
  j24303: '24303', // 制冷工
  j24400: '24400', // 炼焦人员
  j24401: '24401', // 炼焦煤制备工
  j24402: '24402', // 炼焦工
  j24500: '24500', // 工艺美术品制作人员
  j24501: '24501', // 景泰蓝制作工
  j24600: '24600', // 木制品制造人员
  j24601: '24601', // 手工木工
  j24700: '24700', // 纺织品和服装剪裁缝纫人员
  j24701: '24701', // 服装制版师
  j24800: '24800', // 印染人员
  j24801: '24801', // 印染 前处理工、印花工、印染后整理工、印染染化料配制工
  j24802: '24802', // 纺织染色工
  j24900: '24900', // 织造人员
  j24901: '24901', // 整经工、织布工
  j25000: '25000', // 纺纱人员
  j25001: '25001', // 纺纱工
  j25002: '25002', // 缫丝工
  j25100: '25100', // 纤维预处理人员
  j25101: '25101', // 纺织纤维梳理工、并条工
  j25200: '25200', // 酒、饮料及精制茶制造人员
  j25201: '25201', // 酿酒师、品酒师
  j25202: '25202', // 酒精酿造工、白酒酿造工、啤酒酿造工、黄酒酿造工、果露酒酿造工
  j25203: '25203', // 评茶员
  j25300: '25300', // 乳制品加工人员
  j25301: '25301', // 乳品评鉴师
  j25400: '25400', // 粮油加工人员
  j25401: '25401', // 制米工、制粉工、制油工
  j25500: '25500', // 动植物疫病防治人员
  j25501: '25501', // 农作物植保员
  j25502: '25502', // 动物疫病防治员、动物检疫检验员
  j25503: '25503', // 水生物病 害防治员
  j25504: '25504', // 林业有害生物防治员
  j25600: '25600', // 农业生产服务人员
  j25601: '25601', // 农机修理工
  j25602: '25602', // 沼气工
  j25603: '25603', // 农业技术员
  j25700: '25700', // 康复矫正服务人员
  j25701: '25701', // 助听器验配师
  j25702: '25702', // 口腔修复体制 作工
  j25703: '25703', // 眼镜验光员、眼镜定配工
  j25800: '25800', // 健康咨询服务人员
  j25801: '25801', // 健康管理师
  j25802: '25802', // 生殖健康咨询师
  j25900: '25900', // 计算机和办公设备维修人员
  j25901: '25901', // 信息通信网络终端维修员
  j26000: '26000', // 汽车摩 托车修理技术服务人员
  j26001: '26001', // 汽车维修工
  j26100: '26100', // 保健服务人员
  j26101: '26101', // 保健调理师
  j26200: '26200', // 美容美发服务人员
  j26201: '26201', // 美容师
  j26202: '26202', // 美发师
  j26300: '26300', // 生活照料服务人员
  j26301: '26301', // 孤残儿童护理 员
  j26302: '26302', // 育婴员
  j26303: '26303', // 保育员
  j26400: '26400', // 有害生物防制人员
  j26401: '26401', // 有害生物防制员
  j26500: '26500', // 环境治理服务人员
  j26501: '26501', // 工业固体废物处理处置工
  j26600: '26600', // 水文服务人员
  j26601: '26601', // 水文勘测工
  j26700: '26700', // 水利设施管养人员
  j26701: '26701', // 河道修防工、水工闸门运行工
  j26702: '26702', // 水工监测工
  j26800: '26800', // 地质勘查人员
  j26801: '26801', // 地勘钻探工
  j26802: '26802', // 地质调查员
  j26803: '26803', // 地勘掘进工、地质实验员、物探工
  j26900: '26900', // 检验、检测和计量服务人员
  j26901: '26901', // 农产品食品检验员
  j26902: '26902', // 纤维检验员
  j26903: '26903', // 贵金属首饰与宝玉石检测员
  j26904: '26904', // 机动车检测工
  j27000: '27000', // 测绘服务人员
  j27001: '27001', // 大地测量员、摄影测量员、地图绘制员
  j27002: '27002', // 不动产测绘员
  j27003: '27003', // 工程测量员
  j27100: '27100', // 安全保护服务人员
  j27101: '27101', // 保安员
  j27102: '27102', // 安检员
  j27103: '27103', // 智能楼宇管理员
  j27104: '27104', // 安全评价师
  j27200: '27200', // 人力资源服务人员
  j27201: '27201', // 劳动 关系协调员
  j27202: '27202', // 企业人力资源管理师
  j27300: '27300', // 物业管理服务人员
  j27301: '27301', // 中央空调系统运行操作员
  j27400: '27400', // 信息通信网络运行管理人员
  j27401: '27401', // 信息通信网络运行管理员
  j27500: '27500', // 广播电视传输服务 人员
  j27501: '27501', // 广播电视天线工
  j27502: '27502', // 有线广播电视机线员
  j27600: '27600', // 信息通信网络维护人员
  j27601: '27601', // 信息通信网络机务员
  j27602: '27602', // 信息通信网络线务员
  j27700: '27700', // 餐饮服务人员
  j27701: '27701', // 中式烹调师
  j27702: '27702', // 中式面点师、西式烹调师、西式面点师
  j27703: '27703', // 茶艺师
  j27800: '27800', // 仓储人员
  j27801: '27801', // （粮油）仓储管理员
  j27900: '27900', // 航空运输服务人员
  j27901: '27901', // 民航乘务员
  j27902: '27902', // 机场运行指挥员
  j28000: '28000', // 道路运输服务人员
  j28001: '28001', // 机动车驾驶教练员
  j28100: '28100', // 消防和应急救援人员
  j28101: '28101', // 消防员
  j28102: '28102', // 森林消防员
  j28103: '28103'// 应急救援员

}

export const JobConsComm = {
  21: '技能人员职业资格',
  22: '专业技术人员职业资格',
  10100: '教师资格',
  10200: '注册消防工程师',
  10300: '法律职业资格',
  10400: '中国委托公证人资格（香港、澳门）',
  10500: '注册会计师',
  10600: '民用核安全设备无损检验人员资格',
  10700: '民用核设施操纵人员资格',
  10800: '注册核安全工程师',
  10900: '注册建筑师',
  11000: '监理工程师',
  11100: '房地产估价师',
  11200: '造价工程师',
  11300: '注册城乡规划师',
  11400: '建造师',
  11500: '勘察设计注册工程师',
  11501: '注册结构工程师',
  11502: '注册土木工程师',
  11503: '注册化工工程师',
  11504: '注册电气工程师',
  11505: '注册公用设备工程师',
  11506: '注册环保工程师',
  11507: '注册石油天然气工程师',
  11508: '注册冶金工程师',
  11509: '注册采矿/矿物工程师',
  11510: '注册机械工程师',
  11600: '注册验船师',
  11700: '船员资格（含船员、渔业船员）',
  11800: '兽医资格',
  11801: '执业兽医',
  11802: '乡村兽医',
  11900: '拍卖师',
  12000: '演出经纪人员资格',
  12100: '医生资格',
  12101: '医师',
  12102: ' 乡村医生',
  12103: '人体器官移植医师',
  12200: '护士执业资格',
  12300: '母婴保健技术服务人员资格',
  12400: '出入境检疫处理人员资格',
  12500: '注册设备监理师',
  12600: '注册计量师',
  12700: '广播电视播音 员、主持人资格',
  12800: '新闻记者职业资格',
  12900: '注册安全工程师',
  13000: '执业药师',
  13100: '专利代理人',
  13200: '导游资格',
  13300: '注册测绘师',
  13400: '航空人员资格',
  13401: '空勤人员、地面人 员',
  13402: '民用航空器外国驾驶员、领航员、飞行机械员、飞行通信员',
  13403: '航空安全员',
  13404: '民用航空电信人员、航行情报人员、气象人员',
  13600: '特种设备检验、检测人员资格认定',
  13700: '工程 咨询（投资）专业技术人员职业资格',
  13800: '通信专业技术人员职业资格',
  13900: '计算机技术与软件专业技术资格',
  14000: '社会工作者职业资格',
  14100: '会计专业技术资格',
  14200: '资产评估师',
  14300: ' 经济专业技术资格',
  14400: '土地登记代理专业人员职业资格',
  14500: '环境影响评价工程师',
  14600: '房地产经纪专业人员职业资格',
  14700: '机动车检测维修专业技术人员职业资格',
  14800: '公路水运工程试验 检测专业技术人员职业资格',
  14900: '水利工程质量检测员资格',
  15000: '卫生专业技术资格',
  15100: '审计专业技术资格',
  15200: '税务师',
  15300: '认证人员职业资格',
  15400: '出版专业技术人员职业资格',
  15500: '统计专业技术资格',
  15600: '银行业专业人员职业资格',
  15700: '证券期货业从业人员资格',
  15800: '文物保护工程从业资格',
  15900: '翻译专业资格',
  19901: '招标师（2019）',
  20100: '消防设施操作员',
  20200: '焊工',
  20300: '家畜繁殖员',
  20400: '健身和娱乐场所服务人员',
  20401: '游泳救生员',
  20402: '社会体育指导员（游泳、滑雪、潜水、攀岩）',
  20500: '轨道交通运输服务人员',
  20501: '轨道列车司机',
  20600: '机械设备修理人员',
  20601: '设备点检员',
  20602: '电工',
  20603: '锅炉设备检修工',
  20604: '变电设备检修工',
  20605: '工程机械维修工',
  20700: '通用工程机械操作人员',
  20701: '起重装卸机械操作工',
  20800: '建筑安装施工人员',
  20801: '电梯安装维修工',
  20802: '制冷空调系统安装维修工',
  20900: '土木工程建筑施工人员',
  20901: '筑路工',
  20902: '桥隧工',
  20903: '防水工',
  20904: '电力电缆安装运维工',
  21000: '房屋建筑施工人员',
  21001: '砌筑工、混凝土工、钢筋工、架子工',
  21100: '水生产、输排和水处理人员',
  21101: '水生产处理工',
  21102: '工业废水处理工',
  21200: '气体生产、处理和输送人员',
  21201: '工业气体生产工',
  21202: '工业废气治理工',
  21203: '压缩机操作工',
  21300: '电力、热力生产 和供应人员',
  21301: '锅炉运行值班员、发电集控值班员、变配电运行值班员、继电保护员',
  21302: '燃气轮机值班员',
  21303: '锅炉操作工',
  21400: '仪器仪表装配人员',
  21401: '钟表及计时仪器制造工',
  21500: '电子设备装 配调试人员',
  21501: '广电和通信设备电子装接工、广电和通信设备调试工',
  21600: '计算机制造人员',
  21601: '计算机及外部设备装配调试员',
  21700: '电子器件制造人员',
  21701: '液晶显示器件制造工',
  21702: '半导体芯片 制造工、半导体分立器件和集成电路装调工',
  21800: '电子元件制造人员',
  21801: '电子产品制版工、印制电路制作工',
  21900: '电线电缆、光纤光缆及电工器材制造人员',
  21901: '电线电缆制造工',
  22000: '输配电及控制设 备制造人员',
  22001: '变压器互感器制造工',
  22002: '高低压电器及成套设备装配工',
  22100: '汽车整车制造人员',
  22101: '汽车装调工',
  22200: '医疗器械制品和康复辅具生产人员',
  22201: '矫形器装配工、假肢装配工',
  22300: '金属加工机械制造人员',
  22301: '机床装调维修工',
  22400: '工装工具制造加工人员',
  22401: '模具工',
  22500: '机械热加工人员',
  22501: '铸造工、锻造工、金属热处理工',
  22600: '机械冷加工人员',
  22601: '车工、铣工',
  22602: '钳工、磨工、冲压工',
  22603: '电切削工',
  22700: '硬质合金生产人员',
  22701: '硬质合金成型工、硬质合金烧结工、硬质合金精加工工',
  22800: '金属轧制人员',
  22801: '轧制原料工、金属轧制工、金属材热处理工、金属 材精整工',
  22802: '金属挤压工、铸轧工',
  22900: '轻有色金属冶炼人员',
  22901: '氧化铝制取工、铝电解工',
  23000: '重有色金属冶炼人员',
  23001: '重冶火法冶炼工、电解精炼工',
  23002: '重冶湿法冶炼工',
  23100: '炼钢人员',
  23101: '炼钢原料工、炼钢工',
  23200: '炼铁人员',
  23201: '高炉原料工、高炉炼铁工、高炉运转工',
  23300: '矿物采选人员',
  23301: '井下支护工',
  23302: '矿山救护工',
  23400: '陶瓷制品制造人员',
  23401: '陶瓷原料准备工、陶瓷烧成工、陶瓷装饰工',
  23500: '玻璃纤维及玻璃纤维增强塑料制品制造人员',
  23501: '玻璃纤维及制品工',
  23502: '玻璃钢制品工',
  23600: '水泥、石灰、石膏及其制品制造人员',
  23601: '水泥 生产工、石膏制品生产工',
  23602: '水泥混凝土制品工',
  23700: '药物制剂人员',
  23701: '药物制剂工',
  23800: '中药饮片加工人员',
  23801: '中药炮制工',
  23900: '涂料、油墨、颜料及类似产品制造人员',
  23901: '涂料生产工、 染料生产工',
  24000: '农药生产人员',
  24001: '农药生产工',
  24100: '化学肥料生产人员',
  24101: '合成氨生产工、尿素生产工',
  24200: '基础化学原料制造人员',
  24201: '硫酸生产工、硝酸生产工、纯碱生产工',
  24202: '烧碱生产工、无机化学反应生产工',
  24203: '有机合成工',
  24300: '化工产品生产通用工艺人员',
  24301: '化工总控工',
  24302: '防腐蚀工',
  24303: '制冷工',
  24400: '炼焦人员',
  24401: '炼焦煤制备工',
  24402: '炼焦工',
  24500: '工艺美术品制作人员',
  24501: '景泰蓝制作工',
  24600: '木制品制造人员',
  24601: '手工木工',
  24700: '纺织品和服装剪裁缝纫人员',
  24701: '服装制版师',
  24800: '印染人员',
  24801: '印染 前处理工、印花工、印染后整理工、印染染化料配制工',
  24802: '纺织染色工',
  24900: '织造人员',
  24901: '整经工、织布工',
  25000: '纺纱人员',
  25001: '纺纱工',
  25002: '缫丝工',
  25100: '纤维预处理人员',
  25101: '纺织纤维梳理工、并条工',
  25200: '酒、饮料及精制茶制造人员',
  25201: '酿酒师、品酒师',
  25202: '酒精酿造工、白酒酿造工、啤酒酿造工、黄酒酿造工、果露酒酿造工',
  25203: '评茶员',
  25300: '乳制品加工人员',
  25301: '乳品评鉴师',
  25400: '粮油加工人员',
  25401: '制米工、制粉工、制油工',
  25500: '动植物疫病防治人员',
  25501: '农作物植保员',
  25502: '动物疫病防治员、动物检疫检验员',
  25503: '水生物病 害防治员',
  25504: '林业有害生物防治员',
  25600: '农业生产服务人员',
  25601: '农机修理工',
  25602: '沼气工',
  25603: '农业技术员',
  25700: '康复矫正服务人员',
  25701: '助听器验配师',
  25702: '口腔修复体制 作工',
  25703: '眼镜验光员、眼镜定配工',
  25800: '健康咨询服务人员',
  25801: '健康管理师',
  25802: '生殖健康咨询师',
  25900: '计算机和办公设备维修人员',
  25901: '信息通信网络终端维修员',
  26000: '汽车摩 托车修理技术服务人员',
  26001: '汽车维修工',
  26100: '保健服务人员',
  26101: '保健调理师',
  26200: '美容美发服务人员',
  26201: '美容师',
  26202: '美发师',
  26300: '生活照料服务人员',
  26301: '孤残儿童护理 员',
  26302: '育婴员',
  26303: '保育员',
  26400: '有害生物防制人员',
  26401: '有害生物防制员',
  26500: '环境治理服务人员',
  26501: '工业固体废物处理处置工',
  26600: '水文服务人员',
  26601: '水文勘测工',
  26700: '水利设施管养人员',
  26701: '河道修防工、水工闸门运行工',
  26702: '水工监测工',
  26800: '地质勘查人员',
  26801: '地勘钻探工',
  26802: '地质调查员',
  26803: '地勘掘进工、地质实验员、物探工',
  26900: '检验、检测和计量服务人员',
  26901: '农产品食品检验员',
  26902: '纤维检验员',
  26903: '贵金属首饰与宝玉石检测员',
  26904: '机动车检测工',
  27000: '测绘服务人员',
  27001: '大地测量员、摄影测量员、地图绘制员',
  27002: '不动产测绘员',
  27003: '工程测量员',
  27100: '安全保护服务人员',
  27101: '保安员',
  27102: '安检员',
  27103: '智能楼宇管理员',
  27104: '安全评价师',
  27200: '人力资源服务人员',
  27201: '劳动 关系协调员',
  27202: '企业人力资源管理师',
  27300: '物业管理服务人员',
  27301: '中央空调系统运行操作员',
  27400: '信息通信网络运行管理人员',
  27401: '信息通信网络运行管理员',
  27500: '广播电视传输服务 人员',
  27501: '广播电视天线工',
  27502: '有线广播电视机线员',
  27600: '信息通信网络维护人员',
  27601: '信息通信网络机务员',
  27602: '信息通信网络线务员',
  27700: '餐饮服务人员',
  27701: '中式烹调师',
  27702: '中式面点师、西式烹调师、西式面点师',
  27703: '茶艺师',
  27800: '仓储人员',
  27801: '（粮油）仓储管理员',
  27900: '航空运输服务人员',
  27901: '民航乘务员',
  27902: '机场运行指挥员',
  28000: '道路运输服务人员',
  28001: '机动车驾驶教练员',
  28100: '消防和应急救援人员',
  28101: '消防员',
  28102: '森林消防员',
  28103: '应急救援员'
}
